zpq001/mdr32f9q-ps200w/source/src/converter.c


#include "MDR32Fx.h" 

#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"


#include "sound_driver.h"
#include "control.h"
#include "converter.h"
#include "converter_hw.h"
#include "adc.h"

#include "guiTop.h"

//-------------------------------------------------------//
// Voltage and current setting return codes
#define VALUE_OK					0x00
#define VALUE_BOUND_BY_SOFT_MAX		0x01
#define VALUE_BOUND_BY_SOFT_MIN		0x02
#define VALUE_BOUND_BY_ABS_MAX		0x04
#define VALUE_BOUND_BY_ABS_MIN		0x08


//-------------------------------------------------------//
// Converter control functions return values

// these can be set simultaneously
#define VOLTAGE_SETTING_APPLIED			0x01	
#define VOLTAGE_LIMIT_APPLIED			0x02
//#define VOLTAGE_SETTING_ARG_MODIFIED	0x04
//#define VOLTAGE_LIMIT_ARG_MODIFIED		0x08
// these can be set simultaneously
#define CURRENT_SETTING_APPLIED			0x01	
#define CURRENT_LIMIT_APPLIED			0x02
//#define CURRENT_SETTING_ARG_MODIFIED	0x04
//#define CURRENT_LIMIT_ARG_MODIFIED		0x08

//-------------------------------------------------------//
// Arguments of Converter_ApplyControls
//#define APPLY_CHANNEL			0x01
//#define APPLY_CURRENT_RANGE		0x02
//#define APPLY_OUTPUT_LOAD		0x04
//#define APPLY_VOLTAGE			0x10
//#define APPLY_CURRENT			0x20


// OS stuff
xQueueHandle xQueueConverter;
xTaskHandle xTaskHandle_Converter;
const converter_message_t converter_overload_msg = {CONVERTER_OVERLOADED};
const converter_message_t converter_tick_message = {CONVERTER_TICK};

gui_msg_t gui_msg;
uint32_t adc_msg;

converter_state_t converter_state;		// main converter control



//---------------------------------------------------------------------------//
///	Checks and sets new value in regulation structure
//---------------------------------------------------------------------------//
static uint8_t SetRegulationValue(reg_setting_t *s, int32_t new_value, uint8_t *errCode)
{
	uint8_t result = 0;
	*errCode = VALUE_OK;
	// Check software limits
	if ((s->enable_low_limit) && (new_value <= (int32_t)s->limit_low))
	{	
		new_value = (int32_t)s->limit_low;
		if (errCode) *errCode = VALUE_BOUND_BY_SOFT_MIN;
	}
	if ((s->enable_high_limit) && (new_value >= (int32_t)s->limit_high)) 
	{
		new_value = (int32_t)s->limit_high;
		if (errCode) *errCode = VALUE_BOUND_BY_SOFT_MAX;
	} 
	// Check absolute limits
	if (new_value <= (int32_t)s->MINIMUM)
	{	
		new_value = (int32_t)s->MINIMUM;
		if (errCode) *errCode = VALUE_BOUND_BY_ABS_MIN;
	}
	if (new_value >= (int32_t)s->MAXIMUM) 
	{
		new_value = (int32_t)s->MAXIMUM;
		if (errCode) *errCode = VALUE_BOUND_BY_ABS_MAX;
	} 
	if (s->setting != new_value)
	{
		s->setting = new_value;
		result = 1;
	}
	return result;
}


//---------------------------------------------------------------------------//
///	Checks and sets new value limit in regultaion structure
//---------------------------------------------------------------------------//
static uint8_t SetRegulationLimit(reg_setting_t *s, uint8_t limit_type, int32_t new_value, uint8_t enable, uint8_t *errCode)
{
	uint8_t result = 0;
	*errCode = VALUE_OK;
	if (new_value <= (int32_t)s->LIMIT_MIN)
	{	
		new_value = (int32_t)s->LIMIT_MIN;
		if (errCode) *errCode = VALUE_BOUND_BY_ABS_MIN;
	}
	if (new_value >= (int32_t)s->LIMIT_MAX) 
	{
		new_value = (int32_t)s->LIMIT_MAX;
		if (errCode) *errCode = VALUE_BOUND_BY_ABS_MAX;
	} 
	if (limit_type == LIMIT_TYPE_LOW)
	{
		if ((s->limit_low != new_value) || (s->enable_low_limit != enable))
		{
			s->limit_low = new_value;
			s->enable_low_limit = enable;
			result = 1;
		}
	}
	else if (limit_type == LIMIT_TYPE_HIGH)
	{
		if ((s->limit_high != new_value) || (s->enable_high_limit != enable))
		{
			s->limit_high = new_value;
			s->enable_high_limit = enable;
			result = 1;
		}
	}
	return result;
}


//---------------------------------------------------------------------------//
///	Set converter output voltage
//	input:
//		channel - converter channel to affect: CHANNEL_5V / CHANNEL_12V / OPERATING_CHANNEL
//		new_value - new value to check and set
//		*err_code - return code providing information about 
//			limiting new value by absolute and software limits
//	output:
//		VOLTAGE_SETTING_APPLIED 	- if new setting has been set
//---------------------------------------------------------------------------//
static uint8_t Converter_SetVoltage(uint8_t channel, int32_t new_value, uint8_t *err_code)
{
	channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : 
						 ((channel == CHANNEL_12V) ? &converter_state.channel_12v : converter_state.channel);
	uint8_t result = 0x00;		
	if (SetRegulationValue(&c->voltage, new_value, err_code))
	{
		result |= VOLTAGE_SETTING_APPLIED;
	}
	return result;
}


//---------------------------------------------------------------------------//
///	Set converter voltage limit
//	input:
//		channel - converter channel to affect: CHANNEL_5V / CHANNEL_12V / OPERATING_CHANNEL
//		limit_type - low or high limit to modify
//		new_value - new value to check and set
//		enable - set limit enabled or disabled
//		*err_code - return code providing information about 
//			limiting new value by absolute and software limits
//	output:
//		VOLTAGE_SETTING_APPLIED - if new voltage setting has been applied
//		VOLTAGE_LIMIT_APPLIED	- if new limit setting has been applied
//---------------------------------------------------------------------------//
static uint8_t Converter_SetVoltageLimit(uint8_t channel, uint8_t limit_type, int32_t new_value, uint8_t enable, uint8_t *err_code)
{
	channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : 
					 ((channel == CHANNEL_12V) ? &converter_state.channel_12v : converter_state.channel);
	uint8_t result = 0;
	if (SetRegulationLimit(&c->voltage, limit_type, new_value, enable, err_code))
	{
		result |= VOLTAGE_LIMIT_APPLIED;
		// Ensure that voltage setting lies inside new limits
		result |= Converter_SetVoltage(channel, c->voltage.setting, 0);
	}
	return result;
}


//---------------------------------------------------------------------------//
///	Set converter output current
//	input:
//		channel - converter channel to affect: CHANNEL_5V / CHANNEL_12V / OPERATING_CHANNEL
//		current_range - 20A range or 40A range to modify. Can be OPERATING_CURRENT_RANGE.
//		new_value - new value to check and set
//		*err_code - return code providing information about 
//			limiting new value by absolute and software limits
//	output:
//		CURRENT_SETTING_APPLIED 	- if new setting has been set
//---------------------------------------------------------------------------//
static uint8_t Converter_SetCurrent(uint8_t channel, uint8_t current_range, int32_t new_value, uint8_t *err_code)
{
	channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : 
						 ((channel == CHANNEL_12V) ? &converter_state.channel_12v : converter_state.channel);
	reg_setting_t *s = (current_range == CURRENT_RANGE_LOW) ? &c->current_low_range : 
						((current_range == CURRENT_RANGE_HIGH) ? &c->current_high_range : c->current);
	uint8_t result = 0;
	if (SetRegulationValue(s, new_value, err_code))
	{
		result = CURRENT_SETTING_APPLIED;
	}
	return 	result;			   
}


//---------------------------------------------------------------------------//
/// Set converter current limit
//	input:
//		channel - converter channel to affect: CHANNEL_5V / CHANNEL_12V / OPERATING_CHANNEL
//		current_range - 20A range or 40A range to modify. Can be OPERATING_CURRENT_RANGE.
//		limit_type - low or high limit to modify
//		new_value - new value to check and set
//		enable - set limit enabled or disabled
//		*err_code - return code providing information about 
//			limiting new value by absolute and software limits
//	output:
//		CURRENT_SETTING_APPLIED - if new current setting has been applied
//		CURRENT_LIMIT_APPLIED	- if new limit setting has been applied
//---------------------------------------------------------------------------//
static uint8_t Converter_SetCurrentLimit(uint8_t channel, uint8_t current_range, uint8_t limit_type, int32_t new_value, uint8_t enable, uint8_t *err_code)
{
	channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : 
						 ((channel == CHANNEL_12V) ? &converter_state.channel_12v : converter_state.channel);
	reg_setting_t *s = (current_range == CURRENT_RANGE_LOW) ? &c->current_low_range : 
						((current_range == CURRENT_RANGE_HIGH) ? &c->current_high_range : c->current);
	uint8_t result = 0;
	if (SetRegulationLimit(s, limit_type, new_value, enable, err_code))
	{
		result = CURRENT_LIMIT_APPLIED;
		// Ensure that current setting lies inside new limits
		result |= Converter_SetCurrent(channel, current_range, s->setting, 0);
	}
	return result;
}


