zpq001/mdr32f9q-ps200w/source/src/converter.c
static void Converter_SetOverloadProtection(uint8_t channel, uint8_t enabled, int32_t new_threshold, uint8_t *err_code)
{
	channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : 
						 ((channel == CHANNEL_12V) ? &converter_state.channel_12v : converter_state.channel);
	
	if (new_threshold < CONV_MIN_OVERLOAD_TIMEOUT)
	{
		new_threshold = CONV_MIN_OVERLOAD_TIMEOUT;
		*err_code = VALUE_BOUND_BY_ABS_MIN;
	}
	else if (new_threshold > CONV_MAX_OVERLOAD_TIMEOUT)
	{
		new_threshold = CONV_MAX_OVERLOAD_TIMEOUT;
		*err_code = VALUE_BOUND_BY_ABS_MAX;
	}
	else
	{
		*err_code = 0;
	}
	
	c->overload_protection_enable = enabled;
	c->overload_timeout = (uint16_t)new_threshold;
}	


//---------------------------------------------------------------------------//
/// Checks if channel has a valid value
// Side-effect: if *channel = OPERATING_CHANNEL (special case), 
//	functions modifies channel to currently operating.
//---------------------------------------------------------------------------//
static uint8_t Converter_ValidateChannel(uint8_t *channel)
{
	if (*channel == OPERATING_CHANNEL)
	{
		*channel = converter_state.channel->CHANNEL;
		return 1;
	}
	if ((*channel == CHANNEL_5V) || (*channel == CHANNEL_12V))
		return 1;
	else
		return 0;
}


//---------------------------------------------------------------------------//
/// Checks if current range has a valid value
// Side-effect: if *range = OPERATING_RANGE (special case), 
//	functions modifies range to currently operating.
//---------------------------------------------------------------------------//
static uint8_t Converter_ValidateCurrentRange(uint8_t *range)
{
	if (*range == OPERATING_CURRENT_RANGE)
	{
		*range = converter_state.channel->current->RANGE;
		return 1;
	}
	if ((*range == CURRENT_RANGE_LOW) || (*range == CURRENT_RANGE_HIGH))
		return 1;
	else
		return 0;
	
}


//---------------------------------------------------------------------------//
/// Checks if limit type has a valid value (LOW or HIGH)
//---------------------------------------------------------------------------//
static uint8_t Converter_ValidateLimit(uint8_t limit)
{
	if ((limit == LIMIT_TYPE_LOW) || (limit == LIMIT_TYPE_HIGH))
		return 1;
	else
		return 0;
}




static void SoundEvent_OnSettingChanged(uint8_t err_code)
{
	uint32_t sound_msg;
	if ((err_code == VALUE_BOUND_BY_SOFT_MAX) || (err_code == VALUE_BOUND_BY_SOFT_MIN))
		sound_msg = SND_CONV_SETTING_ILLEGAL;
	else if ((err_code == VALUE_BOUND_BY_ABS_MAX) || (err_code == VALUE_BOUND_BY_ABS_MIN))
		sound_msg = SND_CONV_SETTING_ILLEGAL;
	else
		sound_msg = SND_CONV_SETTING_OK;
	sound_msg |= SND_CONVERTER_PRIORITY_NORMAL;
	xQueueSendToBack(xQueueSound, &sound_msg, 0); 
}

static void SoundEvent_OnOverload(void)
{
	uint32_t sound_msg;
	sound_msg = SND_CONV_OVERLOADED | SND_CONVERTER_PRIORITY_HIGHEST;
	xQueueSendToBack(xQueueSound, &sound_msg, 0); 
}

static void SoundEvent_OnGenericError(void)
{
	uint32_t sound_msg;
	sound_msg = SND_CONV_CMD_ILLEGAL | SND_CONVERTER_PRIORITY_HIGHEST;	// FIXME
	xQueueSendToBack(xQueueSound, &sound_msg, 0);
}




void Converter_Init(uint8_t default_channel)
{
	// Converter is powered off.
	// TODO: add restore from EEPROM
	
	//---------- Channel 5V ------------//
	
	converter_state.channel_5v.CHANNEL = CHANNEL_5V;
	converter_state.channel_5v.load_state = LOAD_ENABLE;
	
	
	// Common
	converter_state.channel_5v.CHANNEL = CHANNEL_5V;
	converter_state.channel_5v.load_state = LOAD_ENABLE;										// dummy - load at 5V channel can not be disabled
	converter_state.channel_5v.overload_protection_enable = 1;									// TODO: EEPROM
	converter_state.channel_5v.overload_timeout = (5*1);										// TODO: EEPROM
	
	// Voltage
	converter_state.channel_5v.voltage.setting = 5000;											// TODO: EEPROM
	converter_state.channel_5v.voltage.MINIMUM = CONV_MIN_VOLTAGE_5V_CHANNEL;					// Minimum voltage setting for channel
	converter_state.channel_5v.voltage.MAXIMUM = CONV_MAX_VOLTAGE_5V_CHANNEL;					// Maximum voltage setting for channel
	converter_state.channel_5v.voltage.limit_low = CONV_MIN_VOLTAGE_5V_CHANNEL;					// TODO: EEPROM
	converter_state.channel_5v.voltage.limit_high = CONV_MAX_VOLTAGE_5V_CHANNEL;				// TODO: EEPROM
	converter_state.channel_5v.voltage.LIMIT_MIN = CONV_MIN_VOLTAGE_5V_CHANNEL;					// Minimum voltage limit setting
	converter_state.channel_5v.voltage.LIMIT_MAX = CONV_MAX_VOLTAGE_5V_CHANNEL;					// Maximum voltage limit setting
	converter_state.channel_5v.voltage.enable_low_limit = 0;									// TODO: EEPROM
	converter_state.channel_5v.voltage.enable_high_limit = 0;									// TODO: EEPROM
	
	// Current
	converter_state.channel_5v.current_low_range.RANGE = CURRENT_RANGE_LOW;						// LOW current range
	converter_state.channel_5v.current_low_range.setting = 4000;								// TODO: EEPROM
	converter_state.channel_5v.current_low_range.MINIMUM = CONV_LOW_CURRENT_RANGE_MIN;			// Minimum current setting for specified current range
	converter_state.channel_5v.current_low_range.MAXIMUM = CONV_LOW_CURRENT_RANGE_MAX;			// Maximum current setting for specified current range
	converter_state.channel_5v.current_low_range.limit_low = CONV_LOW_CURRENT_RANGE_MIN;		// TODO: EEPROM
	converter_state.channel_5v.current_low_range.limit_high = CONV_LOW_CURRENT_RANGE_MAX;		// TODO: EEPROM
	converter_state.channel_5v.current_low_range.LIMIT_MIN = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current limit setting
	converter_state.channel_5v.current_low_range.LIMIT_MAX = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current limit setting
	converter_state.channel_5v.current_low_range.enable_low_limit = 0;							// TODO: EEPROM
	converter_state.channel_5v.current_low_range.enable_high_limit = 0;							// TODO: EEPROM
	
	converter_state.channel_5v.current_high_range.RANGE = CURRENT_RANGE_HIGH;					// HIGH current range
	converter_state.channel_5v.current_high_range.setting = 4000;								// TODO: EEPROM
	converter_state.channel_5v.current_high_range.MINIMUM = CONV_HIGH_CURRENT_RANGE_MIN;		// Minimum current setting for specified current range
	converter_state.channel_5v.current_high_range.MAXIMUM = CONV_HIGH_CURRENT_RANGE_MAX;		// Maximum current setting for specified current range
	converter_state.channel_5v.current_high_range.limit_low = CONV_HIGH_CURRENT_RANGE_MIN;		// TODO: EEPROM
	converter_state.channel_5v.current_high_range.limit_high = CONV_HIGH_CURRENT_RANGE_MAX;		// TODO: EEPROM
	converter_state.channel_5v.current_high_range.LIMIT_MIN = CONV_HIGH_CURRENT_RANGE_MIN;		// Minimum current limit setting
	converter_state.channel_5v.current_high_range.LIMIT_MAX = CONV_HIGH_CURRENT_RANGE_MAX;		// Maximum current limit setting
	converter_state.channel_5v.current_high_range.enable_low_limit = 0;							// TODO: EEPROM
	converter_state.channel_5v.current_high_range.enable_high_limit = 0;						// TODO: EEPROM

	converter_state.channel_5v.current = &converter_state.channel_5v.current_low_range;
	
