zpq001/mdr32f9q-ps200w/source/src/converter.c
	//---------- Channel 12V -----------//
	
	// Common
	converter_state.channel_12v.CHANNEL = CHANNEL_12V;
	converter_state.channel_12v.load_state = LOAD_ENABLE;										
	converter_state.channel_12v.overload_protection_enable = 1;									// TODO: EEPROM
	converter_state.channel_12v.overload_timeout = (5*1);										// TODO: EEPROM
	
	// Voltage
	converter_state.channel_12v.voltage.setting = 12000;										// TODO: EEPROM
	converter_state.channel_12v.voltage.MINIMUM = CONV_MIN_VOLTAGE_12V_CHANNEL;					// Minimum voltage setting for channel
	converter_state.channel_12v.voltage.MAXIMUM = CONV_MAX_VOLTAGE_12V_CHANNEL;					// Maximum voltage setting for channel
	converter_state.channel_12v.voltage.limit_low = CONV_MIN_VOLTAGE_12V_CHANNEL;				// TODO: EEPROM
	converter_state.channel_12v.voltage.limit_high = CONV_MAX_VOLTAGE_12V_CHANNEL;				// TODO: EEPROM
	converter_state.channel_12v.voltage.LIMIT_MIN = CONV_MIN_VOLTAGE_12V_CHANNEL;				// Minimum voltage limit setting
	converter_state.channel_12v.voltage.LIMIT_MAX = CONV_MAX_VOLTAGE_12V_CHANNEL;				// Maximum voltage limit setting
	converter_state.channel_12v.voltage.enable_low_limit = 0;									// TODO: EEPROM
	converter_state.channel_12v.voltage.enable_high_limit = 0;									// TODO: EEPROM
	
	// Current
	converter_state.channel_12v.current_low_range.RANGE = CURRENT_RANGE_LOW;					// LOW current range
	converter_state.channel_12v.current_low_range.setting = 2000;								// TODO: EEPROM
	converter_state.channel_12v.current_low_range.MINIMUM = CONV_LOW_CURRENT_RANGE_MIN;			// Minimum current setting for specified current range
	converter_state.channel_12v.current_low_range.MAXIMUM = CONV_LOW_CURRENT_RANGE_MAX;			// Maximum current setting for specified current range
	converter_state.channel_12v.current_low_range.limit_low = CONV_LOW_CURRENT_RANGE_MIN;		// TODO: EEPROM
	converter_state.channel_12v.current_low_range.limit_high = CONV_LOW_CURRENT_RANGE_MAX;		// TODO: EEPROM
	converter_state.channel_12v.current_low_range.LIMIT_MIN = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current limit setting
	converter_state.channel_12v.current_low_range.LIMIT_MAX = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current limit setting
	converter_state.channel_12v.current_low_range.enable_low_limit = 0;							// TODO: EEPROM
	converter_state.channel_12v.current_low_range.enable_high_limit = 0;						// TODO: EEPROM
	
	// 12V channel cannot provide currents > 20A (low range)
	converter_state.channel_12v.current_high_range.RANGE = CURRENT_RANGE_HIGH;					// HIGH current range
	converter_state.channel_12v.current_high_range.setting = 4000;								// TODO: EEPROM
	converter_state.channel_12v.current_high_range.MINIMUM = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current setting for specified current range
	converter_state.channel_12v.current_high_range.MAXIMUM = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current setting for specified current range
	converter_state.channel_12v.current_high_range.limit_low = CONV_LOW_CURRENT_RANGE_MIN;		// TODO: EEPROM
	converter_state.channel_12v.current_high_range.limit_high = CONV_LOW_CURRENT_RANGE_MAX;		// TODO: EEPROM
	converter_state.channel_12v.current_high_range.LIMIT_MIN = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current limit setting
	converter_state.channel_12v.current_high_range.LIMIT_MAX = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current limit setting
	converter_state.channel_12v.current_high_range.enable_low_limit = 0;						// TODO: EEPROM
	converter_state.channel_12v.current_high_range.enable_high_limit = 0;						// TODO: EEPROM

	converter_state.channel_12v.current = &converter_state.channel_12v.current_low_range;
	
	
	// Select default channel
	converter_state.channel = (default_channel == CHANNEL_5V) ? &converter_state.channel_5v : 
								&converter_state.channel_12v;
	
	Converter_TurnOff();
	while(Converter_IsReady() == 0);
	SetFeedbackChannel(converter_state.channel->CHANNEL);
	SetCurrentRange(converter_state.channel->current->RANGE);
	SetVoltageDAC(converter_state.channel->voltage.setting);
	SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
	SetOutputLoad(converter_state.channel->load_state);

	// Overload protection mechanism uses data from converter_regulation, so no
	// 	special settings are required.
}


//---------------------------------------------//
//	Main converter task
//	
//---------------------------------------------//
void vTaskConverter(void *pvParameters) 
{
	converter_message_t msg;
	
	uint8_t err_code;
	uint8_t res;
	
	
	// Initialize
	xQueueConverter = xQueueCreate( 5, sizeof( converter_message_t ) );		// Queue can contain 5 elements of type converter_message_t
	if( xQueueConverter == 0 )
	{
		// Queue was not created and must not be used.
		while(1);
	}
	
	// Wait until task is started by dispatcher		
	vTaskSuspend(0);			
	
	xQueueReset(xQueueConverter);
	while(1)
	{

		xQueueReceive(xQueueConverter, &msg, portMAX_DELAY);


		switch(msg.type)
		{
			//=========================================================================//
			// Setting voltage
			case CONVERTER_SET_VOLTAGE:
				if (Converter_ValidateChannel(&msg.voltage_setting.channel))
				{
					res = Converter_SetVoltage(msg.voltage_setting.channel, msg.voltage_setting.value, &err_code);
					// Apply new setting to hardware
					if (res & VOLTAGE_SETTING_APPLIED)
					{
						// CHECKME: charge state
						if (msg.voltage_setting.channel == converter_state.channel->CHANNEL)
						{
							SetVoltageDAC(converter_state.channel->voltage.setting);
						}
					}
					// Send notification to GUI
					gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
					gui_msg.converter_event.spec = VOLTAGE_SETTING_CHANGED;
					gui_msg.converter_event.channel = msg.voltage_setting.channel;
					xQueueSendToBack(xQueueGUI, &gui_msg, 0);

					// Sound feedback
					SoundEvent_OnSettingChanged(err_code);
				}
				else
				{
					// Wrong argument (channel)
				}
				break;
			//=========================================================================//
			// Setting voltage limit
			case CONVERTER_SET_VOLTAGE_LIMIT:
				if (Converter_ValidateChannel(&msg.voltage_limit_setting.channel) && Converter_ValidateLimit(msg.voltage_limit_setting.type))
				{
					res = Converter_SetVoltageLimit(msg.voltage_limit_setting.channel, msg.voltage_limit_setting.type, 
										msg.voltage_limit_setting.value, msg.voltage_limit_setting.enable, &err_code);
					// Apply new setting to hardware
					if (res & VOLTAGE_SETTING_APPLIED)
					{
						// CHECKME: charge state
						if (msg.voltage_limit_setting.channel == converter_state.channel->CHANNEL)
						{
							SetVoltageDAC(converter_state.channel->voltage.setting);
						}
					}
					// Send notification to GUI
					gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
					gui_msg.converter_event.spec = VOLTAGE_LIMIT_CHANGED | VOLTAGE_SETTING_CHANGED;
					gui_msg.converter_event.channel = msg.voltage_limit_setting.channel;
					gui_msg.converter_event.type = msg.voltage_limit_setting.type;
					xQueueSendToBack(xQueueGUI, &gui_msg, 0);
					
