zpq001/mdr32f9q-ps200w/source/src/converter.c
					// Sound feedback
					SoundEvent_OnSettingChanged(err_code);
				}
				else
				{
					// Wrong argument (channel or limit type)
				}
				break;
			//=========================================================================//
			// Setting current
			case CONVERTER_SET_CURRENT:
				if (Converter_ValidateChannel(&msg.current_setting.channel) && Converter_ValidateCurrentRange(&msg.current_setting.range))
				{
					res = Converter_SetCurrent(msg.current_setting.channel, msg.current_setting.range, msg.current_setting.value, &err_code);
					// Apply new setting to hardware
					if (res & CURRENT_SETTING_APPLIED)
					{
						// CHECKME: charge state
						if ((msg.current_setting.channel == converter_state.channel->CHANNEL) && 
							(msg.current_setting.range == converter_state.channel->current->RANGE))
						{
							SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
						}
					}
					// Send notification to GUI
					gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
					gui_msg.converter_event.spec = CURRENT_SETTING_CHANGED;
					gui_msg.converter_event.channel = msg.current_setting.channel;
					gui_msg.converter_event.current_range = msg.current_setting.range;
					xQueueSendToBack(xQueueGUI, &gui_msg, 0);
				
					// Sound feedback
					SoundEvent_OnSettingChanged(err_code);
				}
				else
				{
					// Wrong argument (channel or range)
				}
				break;
			//=========================================================================//
			// Setting current limit
			case CONVERTER_SET_CURRENT_LIMIT:
				if (Converter_ValidateChannel(&msg.current_limit_setting.channel) && Converter_ValidateCurrentRange(&msg.current_limit_setting.range) &&
					Converter_ValidateLimit(msg.current_limit_setting.type))
				{
					res = Converter_SetCurrentLimit(msg.current_limit_setting.channel, msg.current_limit_setting.range, msg.current_limit_setting.type, 
										msg.current_limit_setting.value, msg.current_limit_setting.enable, &err_code);
					if (res & CURRENT_SETTING_APPLIED)
					{
						// Apply new setting to hardware
						// CHECKME: charge state
						if ((msg.current_limit_setting.channel == converter_state.channel->CHANNEL) && 
							(msg.current_setting.range == converter_state.channel->current->RANGE))
						{
							SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
						}
					}
					// Send notification to GUI
					gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
					gui_msg.converter_event.spec = CURRENT_LIMIT_CHANGED | CURRENT_SETTING_CHANGED;
					gui_msg.converter_event.channel = msg.current_limit_setting.channel;
					gui_msg.converter_event.type = msg.current_limit_setting.type;
					gui_msg.converter_event.current_range = msg.current_limit_setting.range;
					xQueueSendToBack(xQueueGUI, &gui_msg, 0);
					
					// Sound feedback
					SoundEvent_OnSettingChanged(err_code);
				}
				{
					// Wrong argument (channel or range or limit type)
				}
				break;
			//=========================================================================//
			// Setting channel
			case CONVERTER_SWITCH_CHANNEL:
				// Check arguments
				if (! Converter_ValidateChannel(&msg.channel_setting.new_channel) )
				{
					break;		// Wrong argument (channel)
				}
				if (msg.channel_setting.new_channel == converter_state.channel->CHANNEL)
				{
					SoundEvent_OnGenericError();
					break;		// Trying to set channel that is already selected.
				}
				// Disable converter if enabled
				if (converter_state.state == CONVERTER_STATE_ON)	// TODO: analyze charge state here
				{
					Converter_TurnOff();
					converter_state.state = CONVERTER_STATE_OFF;
				}
				
				// Wait until voltage feedback switching is allowed
				while(Converter_IsReady() == 0) 
					vTaskDelay(1);
				res = Converter_SetFeedBackChannel(msg.channel_setting.new_channel);
				if (res != CONVERTER_CMD_OK)
				{
					// Unexpected error
					Converter_TurnOff();
					SoundEvent_OnGenericError();
					break;
				}
				converter_state.channel = (msg.channel_setting.new_channel == CHANNEL_5V) ? &converter_state.channel_5v : 
											&converter_state.channel_12v;
				while(Converter_IsReady() == 0) 
					vTaskDelay(1);	
				res = Converter_SetCurrentRange(converter_state.channel->current->RANGE);
				if (res != CONVERTER_CMD_OK)
				{
					// Unexpected error
					Converter_TurnOff();
					SoundEvent_OnGenericError();
					break;
				} 
				//SetCurrentRange(converter_state.channel->current->RANGE);
				SetVoltageDAC(converter_state.channel->voltage.setting);
				SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
				SetOutputLoad(converter_state.channel->load_state);

				// Send notification to GUI
				gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
				gui_msg.converter_event.spec = CHANNEL_CHANGED;
				gui_msg.converter_event.channel = msg.channel_setting.new_channel;
				gui_msg.converter_event.current_range = converter_state.channel->current->RANGE;
				xQueueSendToBack(xQueueGUI, &gui_msg, 0);
				// No sound feeback (a relay is ticking)

				break;
			//=========================================================================//
			// Setting current range
			case CONVERTER_SET_CURRENT_RANGE:
				if (converter_state.state == CONVERTER_STATE_ON)	// TODO: analyze charge state here
				{
					SoundEvent_OnGenericError();
					break;			// Ignore this when converter is enabled
				}
				if (! Converter_ValidateChannel(&msg.current_range_setting.channel) )
				{
					break;			// Wrong argument (channel)
				}	
				if (! Converter_ValidateCurrentRange(&msg.current_range_setting.new_range) )
				{
					break;			// Wrong argument (new_range)
				}
				if ( (msg.current_range_setting.new_range == converter_state.channel->current->RANGE) && 
					 (msg.current_range_setting.channel == converter_state.channel->CHANNEL) )
				{
					SoundEvent_OnSettingChanged(VALUE_BOUND_BY_ABS_MAX);
					break;			// Trying to set current range that is already selected.
				}
				
				// Wait until current feedback switching is allowed
				while(Converter_IsReady() == 0) 
					vTaskDelay(1);	
				
				res = Converter_SetCurrentRange(msg.current_range_setting.new_range);
				if (res != CONVERTER_CMD_OK)
				{
					// Unexpected error
					Converter_TurnOff();
					SoundEvent_OnGenericError();
					break;
				}
				
				converter_state.channel->current = (msg.current_range_setting.new_range == CURRENT_RANGE_LOW) ? &converter_state.channel->current_low_range : 
														&converter_state.channel->current_high_range;
				SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
		
				// Send notification to GUI
				gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
				gui_msg.converter_event.spec = CURRENT_RANGE_CHANGED;
				gui_msg.converter_event.channel = msg.current_range_setting.channel;
				gui_msg.converter_event.current_range = msg.current_range_setting.new_range;
				xQueueSendToBack(xQueueGUI, &gui_msg, 0);
				// Sound feedback
				//SoundEvent_OnSettingChanged(VALUE_OK);
				break;
			//=========================================================================//
			// Setting overload protection parameters
			case CONVERTER_SET_OVERLOAD_PARAMS:
				if (! Converter_ValidateChannel(&msg.overload_setting.channel) )
				{
					break;			// Wrong argument (channel)
				}	
				Converter_SetOverloadProtection(msg.overload_setting.channel, msg.overload_setting.enable, msg.overload_setting.value, &err_code);
				// Send notification to GUI
				gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
				gui_msg.converter_event.spec = OVERLOAD_SETTING_CHANGED;
				gui_msg.converter_event.channel = msg.overload_setting.channel;				
				xQueueSendToBack(xQueueGUI, &gui_msg, 0);					
				
