zpq001/mdr32f9q-ps200w/source/src/converter.c
				// Sound feedback
				SoundEvent_OnSettingChanged(err_code);
			
				break;
			//=========================================================================//
			// Turn ON
			case CONVERTER_TURN_ON:
				if ((converter_state.state == CONVERTER_STATE_OFF) || (converter_state.state == CONVERTER_STATE_OVERLOADED))
				{
					res = Converter_TurnOn();
					if (res == CONVERTER_CMD_OK)
					{
						converter_state.state = CONVERTER_STATE_ON;
					}
					else
					{
						SoundEvent_OnGenericError();
					}
				}
				break;
			//=========================================================================//
			// Turn OFF
			case CONVERTER_TURN_OFF:
				if (converter_state.state == CONVERTER_STATE_ON)
				{
					Converter_TurnOff();
				}
				converter_state.state = CONVERTER_STATE_OFF;	// Reset overloaded state
				break;
			//=========================================================================//
			// Overload
			case CONVERTER_OVERLOADED:
				// Converter has been overloaded and disabled by low-level interrupt-driven routine.
				// Reset that routine FSM flag
				if (Converter_ClearOverloadFlag() == CONVERTER_CMD_OK)
				{
					// OK, flag has been reset.
					SoundEvent_OnOverload();
					converter_state.state = CONVERTER_STATE_OVERLOADED;
				}	
				else
				{
					// Error, we should never get here.
					SoundEvent_OnGenericError();
					// Kind of restore attempt
					Converter_TurnOff();
					converter_state.state = CONVERTER_STATE_OFF;
				}
				break;
			//=========================================================================//
			// Tick
			case CONVERTER_TICK:		// Temporary! Will be special for charging mode
				// ADC task is responsible for sampling and filtering voltage and current
				adc_msg = ADC_GET_ALL_NORMAL;
				xQueueSendToBack(xQueueADC, &adc_msg, 0);
				break;
				
			default:;
		}
	}

}






